apache-camel-integration/RequestResponseXMLs/ReservationServiceRequest1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quot="http://air.sample.com/quote/">
   <soapenv:Header/>
   <soapenv:Body>
      <quot:getQuote>
         <getQuote>
            <source>HYD</source>
            <destination>CHN</destination>
            <date>25/09/2013</date>
            <airline>AirLineA</airline>
         </getQuote>
      </quot:getQuote>
   </soapenv:Body>
</soapenv:Envelope>